In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,"c":30}

In [5]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(labels,arr)

10    a
20    b
30    c
dtype: object

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],index=['USA','Germany','Italy','Japan'])

In [15]:
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [16]:
ser2=pd.Series([1,2,4,5], index=['USA','Italy','Germany','Japan'])

In [17]:
ser2

USA        1
Italy      2
Germany    4
Japan      5
dtype: int64

In [20]:
ser2['Germany']

4

In [30]:
ser1[0]

1

In [31]:
ser1+ser2

Germany    6
Italy      5
Japan      9
USA        2
dtype: int64

In [32]:
from numpy.random import randn
np.random.seed(101)

In [34]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [44]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [46]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [47]:
type(df['W'])

pandas.core.series.Series

In [50]:
df['new']=df['W']+df['Y']

In [51]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [55]:
df.drop('new',axis=1, inplace= True)

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [60]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [63]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [64]:
df.loc['B']['Y']

-0.8480769834036315

In [68]:
df.loc[['B'],['Y','Z']]

          Y         Z
B -0.848077  0.605965

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [71]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [77]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [81]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [137]:
df

              W         X         Y         Z baoxiong
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸

In [84]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [86]:
newind='CA NY WY OR CO'.split()

In [87]:
df['States']=newind

In [88]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [89]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [136]:
df

              W         X         Y         Z baoxiong
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸

In [99]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [100]:
df.reset_index('States')

  States         W         X         Y         Z
0     CA  2.706850  0.628133  0.907969  0.503826
1     NY  0.651118 -0.319318 -0.848077  0.605965
2     WY -2.018168  0.740122  0.528813 -0.589001
3     OR  0.188695 -0.758872 -0.933237  0.955057
4     CO  0.190794  1.978757  2.605967  0.683509

In [128]:
df

              W         X         Y         Z baoxiong
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸

In [129]:
df.reset_index()

  胖熊爱宝宝         W         X         Y         Z baoxiong
0   鸭嘴熊  2.706850  0.628133  0.907969  0.503826      鸭嘴熊
1    大宝  0.651118 -0.319318 -0.848077  0.605965       大宝
2    胖熊 -2.018168  0.740122  0.528813 -0.589001       胖熊
3    嘟嘟  0.188695 -0.758872 -0.933237  0.955057       嘟嘟
4   胖狐狸  0.190794  1.978757  2.605967  0.683509      胖狐狸

In [130]:
newind='鸭嘴熊 大宝 胖熊 嘟嘟 胖狐狸'.split()

In [131]:
df['胖熊爱宝宝']=newind

In [132]:
df

              W         X         Y         Z baoxiong 胖熊爱宝宝
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊   鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝    大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊    胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟    嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸   胖狐狸

In [133]:
df.set_index('胖熊爱宝宝')

              W         X         Y         Z baoxiong
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸

In [134]:
df

              W         X         Y         Z baoxiong 胖熊爱宝宝
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊   鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝    大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊    胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟    嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸   胖狐狸

In [141]:
df

              W         X         Y         Z baoxiong
胖熊爱宝宝
鸭嘴熊    2.706850  0.628133  0.907969  0.503826      鸭嘴熊
大宝     0.651118 -0.319318 -0.848077  0.605965       大宝
胖熊    -2.018168  0.740122  0.528813 -0.589001       胖熊
嘟嘟     0.188695 -0.758872 -0.933237  0.955057       嘟嘟
胖狐狸    0.190794  1.978757  2.605967  0.683509      胖狐狸

In [142]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [143]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [150]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A', 'B'])

In [151]:
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [153]:
df.loc['G1']

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [162]:
df.loc['G1']['A']

1    1.025984
2   -0.031579
3    2.154846
Name: A, dtype: float64

In [164]:
df.loc['G1'].loc[1].loc['A']

1.025984152081572

In [166]:
df.index.names

FrozenList([None, None])

In [167]:
df.index.names=['Group','Num']

In [168]:
df

                  A         B
Group Num
G1    1    1.025984 -0.156598
      2   -0.031579  0.649826
      3    2.154846 -0.610259
G2    1   -0.755325 -0.346419
      2    0.147027 -0.479448
      3    0.558769  1.024810

In [169]:
df.loc['G1']

            A         B
Num
1    1.025984 -0.156598
2   -0.031579  0.649826
3    2.154846 -0.610259

In [170]:
df.xs('G1')

            A         B
Num
1    1.025984 -0.156598
2   -0.031579  0.649826
3    2.154846 -0.610259

In [171]:
df.xs(['G1',1])

A    1.025984
B   -0.156598
Name: (G1, 1), dtype: float64

In [177]:
df.xs(1, level='Num')

              A         B
Group
G1     1.025984 -0.156598
G2    -0.755325 -0.346419

In [178]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Charle','Vannessa','David','Amy','Carl','Lars'],'Sales':[200,120,340,124,243,350]}

In [181]:
df=pd.DataFrame(data)

In [182]:
df

  Company    Person  Sales
0    GOOG    Charle    200
1    GOOG  Vannessa    120
2    MSFT     David    340
3    MSFT       Amy    124
4      FB      Carl    243
5      FB      Lars    350

In [184]:
df.groupby('Company')

In [185]:
by_compy=df.groupby('Company')

In [187]:
by_compy.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [188]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [189]:
by_compy.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [191]:
by_compy.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [192]:
by_compy.max()

           Person  Sales
Company
FB           Lars    350
GOOG     Vannessa    200
MSFT        David    340

In [193]:
by_compy.min()

         Person  Sales
Company
FB         Carl    243
GOOG     Charle    120
MSFT        Amy    124

In [194]:
by_compy.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [206]:
by_compy.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [211]:
by_compy.describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [212]:
df1=pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],'B':['B0', 'B1', 'B2', 'B3'],'C':['C0', 'C1', 'C2', 'C3'],'D':['D0', 'D1', 'D2', 'D3']},index=[0,1,2,3])

In [213]:
df2=pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [214]:
df3=pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],'B': ['B8', 'B9', 'B10', 'B11'],'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},index=[8,9,10,11])

In [215]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [216]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [217]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [218]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [219]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [220]:
left=pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

In [221]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [222]:
right=pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [223]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [224]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [235]:
left=pd.DataFrame({'key1':['K0', 'K0', 'K1', 'K2'],'key2': ['K0', 'K1', 'K0', 'K1'],'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [236]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [233]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [237]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [230]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [231]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [238]:
left=pd.DataFrame({'A':['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

In [240]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [241]:
right=pd.DataFrame({'C':['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [242]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [243]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [244]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [245]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [246]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [247]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [248]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [249]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [250]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [251]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [252]:
df.to_csv('example',index=False)

In [255]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/pandas/io/excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [258]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

ModuleNotFoundError: No module named 'openpyxl'